<!-- dflook/terraform-github-actions {"workspace":"junit-xml-2","backend_type":"remote","backend":"b37d6d4c5fb89c8fd930cbe19053ccb673903a36c44b46763a914dc1efd18e15","plan_job_ref":"Job Test Terraform cloud #285 at https://github.com/dflook/terraform-github-actions/actions/runs/13593327824","plan_hash":"dd91a27e087dbfef1694e0511df3a6b6815a229a8f28ddef00f2d7af460eac81","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __junit-xml-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #285](https://github.com/dflook/terraform-github-actions/actions/runs/13593327824)